Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ZoneWithoutSpacesWarn
This zone has no spaces.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedSpaces
There are undefined Spaces in the model! Recommend creating a Space schedule and checking the Area parameter of each Space for warnings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedRooms
There are undefined Rooms in the model! Recommend creating a Room schedule and checking the Area parameter of each Room for warnings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SurfaceResolutionOutOfRange
Pixel size is out of range.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SpaceResolutionOutOfRange
Voxel size is out of range.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNotComputedWarn
[Family] volume can't be computed. The bounding geometry (in 3D) can't be found for [Room]. [Room] will be ignored in the energy analysis model.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNegativeWarn
[Room] has a negative volume? [Room] will be ignored in the energy analysis model.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotUpperBoundedByElement
[Family] is not upper bounded by a roof, ceiling or floor element. This can result in incorrect adjacencies and voids in the analytical model. Please ensure that Upper Limit and Limit Offset for [Room] is set correctly.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotPlacedWarn
[Family] is not placed. Physical properties such as area will display as "Not Placed" in schedules. You can place the [Family] using the option bar in the [Family] tool, or you can delete the [Family] in a schedule. [Room] will be ignored in the energy analysis model.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement
An error occurred while trimming the vertical shadow of a room-bounding element [Name] of the bounding geometry for [Room].

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotOverlapBoundingElement
An error occurred while trying to find the region where a face of the bounding geometry for [Room] overlaps a face of a room-bounding element [Name].

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotFindFreeFacesBoundingElement
An error occurred while trying to find the free part of a face of the bounding geometry for [Room] when processing the room-bounding element [Name]. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ProblemWithPowerLoadWarn
[Room]'s power load is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ProblemWithPeopleLoadWarn
[Room]'s number of people or people load (sensible or latent) is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ProblemWithLightingLoadWarn
[Room]'s lighting load is too high.  This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.PlenumWithNoCeilingWarn
[Room] has Space Type set to Plenum but has no ceiling surface.  A plenum must be separated from the space it serves by a ceiling.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpacesWarn
Revit was unable to identify any spaces. If you are sure that spaces have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which spaces have been defined in your project.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaces
Revit was unable to identify any spaces. If you are sure that spaces have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which spaces have been defined in your project.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElementsWarn
Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElements
Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomsWarn
Revit was unable to identify any rooms. If you are sure that rooms have been created in the project, please check the Project Phase setting to verify that the Project Phase matches the phase in which rooms have been defined in your project.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElementsWarn
Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElements
Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsSpacesBoundingWarn
The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are space bounding, and make sure that the space offsets are high enough to include the roofs.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsRoomBoundingWarn
The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are room bounding, and make sure that the room offsets are high enough to include the roofs.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoOccupiedSpacesWarn
The model has no occupiable spaces.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ModelWithNoConditionedSpacesWarn
The model has no conditioned spaces.

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ComputeRoomVolumeNotCheckedWarn
The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes

Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures
Failures about EnergyAnalysis.